from paddleocr import PaddleOCR, draw_ocr
from PIL import Image
# import paddle
# paddle.utils.run_check()
ocr = PaddleOCR(use_angle_cls=True, lang='ch')
img_path = 'Python\\Study\\4.paddle ocr.png'
result = ocr.ocr(img_path, cls=True)
# image=Image.open(img_path).convert('RGB')
# txts=[line[1][0] for line in result]
txt=''
for lines in result:
    for line in lines:
        txt=txt+str(line[-1][0])
print(txt)

# t = [
#     [[[21.0, 25.0], [60.0, 21.0], [62.0, 42.0], [23.0, 46.0]], ('ZOL', 0.8998255729675293)], 
#      [[[78.0, 29.0], [180.0, 29.0], [180.0, 51.0], [78.0, 51.0]], ('中关村在线', 0.9603122472763062)], 
#      [[[24.0, 84.0], [963.0, 84.0], [963.0, 119.0], [24.0, 119.0]], ('微 软Win11安卓子系统2306预览版更新，改进网络、画', 0.9475606083869934)],
#      [[[23.0, 131.0], [260.0, 131.0], [260.0, 170.0], [23.0, 170.0]], ('中画、存储等', 0.9898952841758728)], 
#      [[[24.0, 199.0], [291.0, 199.0], [291.0, 217.0], [24.0, 217.0]], ('中关村在线的报 道·10小时前', 0.906351625919342)], 
#      [[[29.0, 303.0], [972.0, 303.0], [972.0, 321.0], [29.0, 321.0]], ('微软正在为Windows 11推出一系列新的改进，包括为运行安卓应用的Windows安卓子系统（WSA）推', 0.9257515072822571)], 
#      [[[27.0, 333.0], [966.0, 334.0], [966.0, 355.0], [27.0, 354.0]], ('出版本2306预览版。该更新带来了多个方面的改进，包括网络、画中画、存储、OneDrive、高级设置', 0.9441908001899719)], 
#      [[[29.0, 368.0], [647.0, 368.0], [647.0, 385.0], [29.0, 385.0]], ('和安全性等。此外，微软还表示该版本包含了许多用户请求的功能,', 0.9440975189208984)], [[[28.0, 431.0], [
#     983.0, 431.0], [983.0, 449.0], [28.0, 449.0]], ('在WSA2306预览版中，相机兼容性得到改进，并增加了按F11键显示悬浮任务栏的功能，提升了鼠标和', 0.9402289390563965)],
#      [[[26.0, 460.0], [968.0, 461.0], [968.0, 482.0], [26.0, 481.0]], ('触摸体验。通过本地网络功能，安卓应用可以 连接到同一网络上的设备，并遵循Windows防火墙规则。', 0.9497342705726624)], 
#      [[[28.0, 493.0], [966.0, 494.0], [966.0, 515.0], [28.0, 514.0]], ('共享用户文件夹功能允许用户更改默认共享文件夹。此外 ，如果应用程序尝试使用子系统没有的权限，', 0.9332209229469299)], 
#      [[[30.0, 528.0], [965.0, 528.0], [965.0, 545.0], [30.0, 545.0]], ('子系统会提示用户。子系统已从EROFS切换到只读磁盘的EXT4。修复 了安卓应用中OneDrive文件夹不', 0.9400386214256287)], 
#      [[[29.0, 561.0], [670.0, 561.0], [670.0, 579.0], [29.0, 579.0]], ('显示的问题。拖放功能支持更多文件类型，画中画功能也得到了改进。', 0.9785112738609314)], 
#      [[[26.0, 620.0], [977.0, 621.0], [977.0, 642.0], [26.0, 641.0]], ('其他改进包括对于至少具有16GB内存的设备，默认启用部分运行模式；ARM设备稳定性修复；Linux内', 0.9345586895942688)], 
#      [[[28.0, 656.0], [481.0, 656.0], [481.0, 674.0], [28.0, 674.0]], ('核更新到5.15.104版本：以及安卓 13的安全更新。', 0.926659882068634)]
#      ]
